tap "hashicorp/tap"
tap "homebrew/bundle"
tap "virtuslab/scala-cli"

brew "duckdb"
brew "fd"
brew "fzf"
brew "jq"
brew "neovim"
brew "node"
brew "postgresql@17"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "hashicorp/tap/terraform"
brew "virtuslab/scala-cli/scala-cli"

cask "anki"
cask "firefox"
cask "font-0xproto-nerd-font"
cask "ghostty"
cask "obsidian"
cask "raycast"
cask "spotify"
