tap "anomalyco/tap"
tap "coursier/formulas"
tap "derailed/k9s"
tap "hashicorp/tap"
tap "jesseduffield/lazydocker"

brew "autojump"
brew "coreutils"
brew "duckdb"
brew "fd"
brew "fzf"
brew "htop"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "postgresql@17"
brew "ripgrep"
brew "shellcheck"
brew "tlrc"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
brew "coursier/formulas/coursier"
brew "derailed/k9s/k9s"
brew "hashicorp/tap/terraform"
brew "jesseduffield/lazydocker/lazydocker"

cask "anki"
cask "dbeaver-community"
cask "docker-desktop"
cask "firefox"
cask "font-0xproto-nerd-font"
cask "ghostty"
cask "obsidian"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
