tap "coursier/formulas"
tap "hashicorp/tap"
tap "jesseduffield/lazygit"

brew "autojump"
brew "coreutils"
brew "duckdb"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "jq"
brew "neovim"
brew "node"
brew "postgresql@17"
brew "ripgrep"
brew "shellcheck"
brew "tmux"
brew "tree"
brew "uv"
brew "wget"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "coursier/formulas/coursier"
brew "hashicorp/tap/terraform"
brew "jesseduffield/lazygit/lazygit"

cask "anki"
cask "docker"
cask "firefox"
cask "font-0xproto-nerd-font"
cask "ghostty"
cask "obsidian"
cask "raycast"
cask "spotify"
cask "vlc"
